jafferrilwaan-png/A.U.R.A-System/firmware/esp32_aura_node.ino
/**
 * ============================================================================
 * PROJECT A.U.R.A. (Autonomous Universal Rescue & Analysis Node)
 * MASTER SYSTEM FIRMWARE: Enterprise Multi-Sensor Rescue Engine v30.0-PROD
 * ============================================================================
 * MODE: BULLETPROOF PRODUCTION MATRIX (I2C Bus Clock Sync & WDT Fix)
 * 1. Fixed ESP-IDF v3 Watchdog & GCC 14.2 Type Deduction
 * 2. 8-Slide Animated OLED Carousel & Multi-Cadence Buzzer Engine
 * 3. OpenRouter Gemini Flash 1.5 Integration
 * 4. Dedicated Core 0 Async Network Task + Full CORS & Private Network Access
 * 5. Small Pond (Nehru Street Sector) Geospatial Anchor: 12.9676 N, 79.9462 E
 * ============================================================================
 * Hardware Pinout:
 *   - ESP32-WROOM-32 Central Node
 *   - MQ-135 Bio-Scent Gas Sensor      -> GPIO 34 (Analog ADC1)
 *   - Piezoelectric Seismic Geophone   -> GPIO 35 (Analog ADC1)
 *   - High-Sensitivity Mic Sensor      -> GPIO 32 (Analog ADC1)
 *   - RCWL-0516 Microwave Radar        -> GPIO 33 (Digital IN)
 *   - Tactical Alert Buzzer            -> GPIO 25 (PWM / Digital OUT)
 *   - SSD1306 128x64 OLED Display      -> SDA: GPIO 21, SCL: GPIO 22 (0x3C)
 *   - MPU-6050 6-Axis IMU              -> SDA: GPIO 21, SCL: GPIO 22 (0x68)
 * ============================================================================
 */

#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Adafruit_MPU6050.h>
#include <Adafruit_Sensor.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <esp_task_wdt.h>

// ----------------------------------------------------------------------------
// PIN DEFINITIONS
// ----------------------------------------------------------------------------
#define PIN_GAS_MQ135   34  
#define PIN_PIEZO       35  
#define PIN_MIC_OUT     32  
#define PIN_RADAR_OUT   33  
#define PIN_BUZZER      25  

#define SCREEN_WIDTH    128
#define SCREEN_HEIGHT   64
#define OLED_RESET      -1
#define SCREEN_ADDRESS  0x3C

#define BUZZER_PWM_CHANNEL 0
#define BUZZER_PWM_RES     8
#define SEISMIC_SAMPLES    128
#define WDT_TIMEOUT_SEC    30

// ----------------------------------------------------------------------------
// NETWORK & CLOUD CREDENTIALS
// ----------------------------------------------------------------------------
const char* ssid = "dhil";
const char* password = "12345678";

const String OPENROUTER_KEY = "YOUR_OPENROUTER_API_KEY"; // Replace with your OpenRouter sk-or-v1-... key before flashing
const char* OPENROUTER_MODEL = "google/gemini-flash-1.5";

// Target Coordinates: Small Pond, Nehru Street Sector
const float GPS_LATITUDE  = 12.9676;
const float GPS_LONGITUDE = 79.9462;

// ----------------------------------------------------------------------------
// GLOBAL OBJECTS & STATE FLAGS
// ----------------------------------------------------------------------------
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
Adafruit_MPU6050 mpu;
WebServer server(80);
TaskHandle_t NetworkTaskHandle = NULL;

bool oledReady = false;
bool mpuReady = false;
bool wifiReady = false;

// ----------------------------------------------------------------------------
// RAW SENSOR SIGNALS
// ----------------------------------------------------------------------------
volatile int rawGas = 0;
volatile int rawPiezo = 0;
volatile int rawMic = 0;
volatile int rawRadar = 0;

// ----------------------------------------------------------------------------
// V20.0 TRUE MATRIX NOISE FLOORS & DEBOUNCERS
// ----------------------------------------------------------------------------
float micNoiseFloor = 14.0f;
float ambientSeismicFloor = 0.0f;
int lastRadarState = 0;
unsigned long lastRadarTransitionTime = 0;

float piezoBaseline = 0.0;
volatile float piezoInstantDelta = 0.0;
volatile float piezoPeakEnvelope = 0.0;
int tapCountWindow = 0;
unsigned long lastTapTimestamp = 0;
int seismicBuffer[SEISMIC_SAMPLES];
int bufferIndex = 0;

volatile float micPeakToPeak = 0.0;
volatile float micEnergy = 0.0;
String acousticSpectrum = "SILENCE / NOISE FLOOR";

// ----------------------------------------------------------------------------
// SPATIAL INTELLIGENCE VARIABLES
// ----------------------------------------------------------------------------
volatile int survivorCount = 0;
volatile float targetDepthMeters = 0.0;
volatile float targetRangeMeters = 0.0;
String survivorZoneColor = "NONE"; 
String spatialPosition = "ALL CLEAR / SCANNING";
volatile int rescueConfidence = 0;

// ----------------------------------------------------------------------------
// ENVIRONMENTAL & BIO-SCENT SENSING
// ----------------------------------------------------------------------------
volatile float envGasPPM = 400.0;
volatile float humanScentPPM = 0.0;
volatile bool humanScentDetected = false;
String humanScentLabel = "CLEAR AMBIENT";

// ----------------------------------------------------------------------------
// IMU / STRUCTURAL VARIABLES
// ----------------------------------------------------------------------------
float prevAx = 0, prevAy = 0, prevAz = 9.8;
volatile float deltaJerk = 0.0;

// ----------------------------------------------------------------------------
// BUZZER ACTUATOR ENGINE
// ----------------------------------------------------------------------------
volatile int buzzerMode = 0;
unsigned long lastBuzzerTick = 0;
bool buzzerPulseState = false;
int cadenceStep = 0;

// ----------------------------------------------------------------------------
// CLOUD AI ENGINE VARIABLES
// ----------------------------------------------------------------------------
String aiStatus = "AI: LOCAL ACTIVE";
String aiClassification = "MONITORING DEBRIS";
volatile bool triggerCloudAiQuery = false;
unsigned long lastAiCallTime = 0;
const unsigned long AI_QUERY_INTERVAL = 6000;

// ----------------------------------------------------------------------------
// 8-SLIDE OLED CAROUSEL ENGINE VARIABLES
// ----------------------------------------------------------------------------
int oledCardIndex = 0;
const int TOTAL_SLIDES = 8;
unsigned long lastSlideSwitch = 0;
const unsigned long SLIDE_INTERVAL_MS = 2500;
int animTick = 0;

// ----------------------------------------------------------------------------
// MAIN LOOP TIMERS
// ----------------------------------------------------------------------------
unsigned long lastDspCycle = 0;
unsigned long lastSlowCycle = 0;
unsigned long lastOledCycle = 0;

// ============================================================================
// HARDWARE ACTUATOR LOGIC (BUZZER CONTROL)
// ============================================================================
void setBuzzerTone(uint32_t freq) {
  if (freq == 0) {
    #if ESP_ARDUINO_VERSION_MAJOR >= 3
      ledcWriteTone(PIN_BUZZER, 0);
    #else
      ledcWriteTone(BUZZER_PWM_CHANNEL, 0);
    #endif
    return;
  }
  
