jafferrilwaan-png/A.U.R.A-System/firmware/esp32_aura_node.ino
  #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWriteTone(PIN_BUZZER, freq);
  #else
    ledcWriteTone(BUZZER_PWM_CHANNEL, freq);
  #endif
}

void executeBuzzerEngine() {
  unsigned long now = millis();
  
  switch (buzzerMode) {
    case 0: 
      setBuzzerTone(0);
      break;

    case 1: 
      if (now - lastBuzzerTick >= 2000) {
        lastBuzzerTick = now;
        setBuzzerTone(1800);
        buzzerPulseState = true;
      } else if (buzzerPulseState && (now - lastBuzzerTick >= 120)) {
        setBuzzerTone(0);
        buzzerPulseState = false;
      }
      break;

    case 2: 
      if (now - lastBuzzerTick >= 400) {
        lastBuzzerTick = now;
        buzzerPulseState = !buzzerPulseState;
        setBuzzerTone(buzzerPulseState ? 2400 : 0);
      }
      break;

    case 3: 
      if (now - lastBuzzerTick >= 220) {
        lastBuzzerTick = now;
        buzzerPulseState = !buzzerPulseState;
        setBuzzerTone(buzzerPulseState ? 3200 : 1600);
      }
      break;

    case 4: 
      if (now - lastBuzzerTick >= 110) {
        lastBuzzerTick = now;
        cadenceStep = (cadenceStep + 1) % 16;
        if (cadenceStep == 0 || cadenceStep == 2 || cadenceStep == 4 || 
            cadenceStep == 7 || cadenceStep == 9 || cadenceStep == 11) {
          setBuzzerTone(2600);
        } else {
          setBuzzerTone(0);
        }
      }
      break;
  }
}

// ============================================================================
// V20.0 TRUE VARIANCE SPATIAL ALGORITHM
// ============================================================================
void processSpatialIntelligence() {
  bool motionActive = (rawRadar == 1);
  bool acousticActive = (micEnergy > 12.0f); 
  bool seismicActive = (piezoPeakEnvelope > 2.0f || tapCountWindow > 0); 
  bool bioScentActive = humanScentDetected;

  int confirmed = 0;
  
  if (motionActive) {
    confirmed++; 
  }
  
  if (seismicActive && tapCountWindow >= 1) {
    confirmed++; 
  }
  
  if (seismicActive && tapCountWindow >= 4) {
    confirmed++; 
  }
  
  if (acousticActive && micEnergy > 30.0f) {
    confirmed++;  
  }
  
  if (confirmed == 0 && bioScentActive) {
    confirmed = 1; 
  }
  
  survivorCount = constrain(confirmed, 0, 3);

  if (survivorCount == 0) {
    targetDepthMeters = 0.0f;
    targetRangeMeters = 0.0f;
    survivorZoneColor = "NONE";
    spatialPosition = "ALL CLEAR / MONITORING";
    rescueConfidence = 0;
  } else {
    float mE = (float)micEnergy;
    float pP = (float)piezoPeakEnvelope;
    float maxEnergy = (mE > pP) ? mE : pP;
    if (maxEnergy < 1.0f) {
      maxEnergy = 1.0f; 
    }
    
    float calculatedDistance = constrain(12.0f / sqrt(maxEnergy), 0.15f, 6.0f);
    targetDepthMeters = calculatedDistance * 0.8f; 
    targetRangeMeters = calculatedDistance;

    if (targetDepthMeters < 0.5f) {
      survivorZoneColor = "GREEN";
      spatialPosition = "SURFACE / IMMEDIATE ACCESS";
    } else if (targetDepthMeters < 2.5f) {
      survivorZoneColor = "RED";
      spatialPosition = "DOWN / MID-DEBRIS CORE";
    } else {
      survivorZoneColor = "WHITE";
      spatialPosition = "VERY DOWN / DEEP SUBTERRANEAN VOID";
    }

    int score = 0;
    if (seismicActive) score += 35;
    if (acousticActive) score += 25;
    if (motionActive) score += 20;
    if (bioScentActive) score += 20;
    rescueConfidence = constrain(score, 15, 99);
  }
}

// ============================================================================
// CLOUD AI TACTICAL INFERENCE (CORE 0)
// ============================================================================
void runInferenceEngineCore0() {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  
  aiStatus = "AI: CLOUD VERIFYING...";
  
  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;

  String prompt = "AURA SAR: Victims=" + String(survivorCount) + " Zone=" + survivorZoneColor +
                  " Depth=" + String(targetDepthMeters, 2) + "m Range=" + String(targetRangeMeters, 2) + 
                  "m Audio=" + acousticSpectrum + " TapPk=" + String((int)piezoPeakEnvelope) +
                  " Taps=" + String(tapCountWindow) + " Scent=" + String((int)humanScentPPM) +
                  "ppm. Classify precise situation and recommend tactical rescue priority in 1 sentence.";

  if (http.begin(client, "https://openrouter.ai/api/v1/chat/completions")) {
    http.addHeader("Content-Type", "application/json");
    http.addHeader("Authorization", "Bearer " + OPENROUTER_KEY);
    http.addHeader("HTTP-Referer", "http://aura-node.local");

    String payload = "{\"model\":\"" + String(OPENROUTER_MODEL) + "\",\"messages\":[{\"role\":\"user\",\"content\":\"" + prompt + "\"}]}";
    int code = http.POST(payload);
    
    if (code == 200) {
      String resp = http.getString();
      #if ARDUINOJSON_VERSION_MAJOR >= 7
        JsonDocument doc;
      #else
        DynamicJsonDocument doc(2048);
      #endif
      
      if (!deserializeJson(doc, resp)) {
        const char* text = doc["choices"][0]["message"]["content"];
        if (text) {
          aiClassification = String(text);
          aiStatus = "AI: CONFIRMED";
        }
      }
    }
    http.end();
  }
}

// ============================================================================
// MICRO-AUDIO BUFFER ENDPOINT
// ============================================================================
void handleAudioCaptureEndpoint() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Private-Network", "true");
  server.sendHeader("Access-Control-Allow-Methods", "GET, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "*");

  String audioJSON = "{\"status\":\"success\",\"sample_rate_hz\":8000,\"raw_data\":[";
  
  for (int i = 0; i < 512; i++) {
    int sample = analogRead(PIN_MIC_OUT);
    audioJSON += String(sample);
    if (i < 511) {
      audioJSON += ",";
    }
    delayMicroseconds(125); 
  }
  
  audioJSON += "]}";
  server.send(200, "application/json", audioJSON);
}

// ============================================================================
// REST API ENDPOINTS (CORE 0) - SAFE DASHBOARD STREAMING
// ============================================================================
void handleTelemetryEndpoint() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Private-Network", "true");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "*");

