jafferrilwaan-png/A.U.R.A-System/firmware/esp32_aura_node.ino
  #if ARDUINOJSON_VERSION_MAJOR >= 7
    JsonDocument doc;
  #else
    StaticJsonDocument<1024> doc;
  #endif

  // Exact Location coordinates for Map view
  doc["lat"] = GPS_LATITUDE;
  doc["lng"] = GPS_LONGITUDE;
  doc["location_name"] = "Small Pond (Nehru Street Sector)";

  doc["survivor_count"] = survivorCount;
  doc["depth_meters"] = targetDepthMeters;
  doc["range_meters"] = targetRangeMeters;
  doc["zone_color"] = survivorZoneColor;
  doc["spatial_position"] = spatialPosition;
  doc["confidence"] = rescueConfidence;
  
  doc["tap_count"] = tapCountWindow;
  doc["seismic_peak"] = (int)piezoPeakEnvelope;
  doc["raw_piezo"] = rawPiezo;
  doc["acoustic_energy"] = (int)micEnergy;
  doc["acoustic_spectrum"] = acousticSpectrum;
  doc["radar"] = rawRadar;
  
  doc["env_gas_ppm"] = (int)envGasPPM;
  doc["human_scent_ppm"] = humanScentPPM;
  doc["human_scent_detected"] = humanScentDetected;
  doc["human_scent_label"] = humanScentLabel; 
  
  doc["delta_jerk"] = deltaJerk;
  doc["buzzer_mode"] = buzzerMode;
  doc["ai_status"] = aiStatus;
  doc["ai_analysis"] = aiClassification;
  doc["ip"] = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();

  String res;
  serializeJson(doc, res);
  server.send(200, "application/json", res);
}

void handleControlEndpoint() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Private-Network", "true");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "*");

  if (server.hasArg("plain")) {
    String body = server.arg("plain");
    
    #if ARDUINOJSON_VERSION_MAJOR >= 7
      JsonDocument doc;
    #else
      DynamicJsonDocument doc(512);
    #endif
    
    if (!deserializeJson(doc, body)) {
      if (doc.containsKey("buzzer_mode")) {
        buzzerMode = constrain(doc["buzzer_mode"].as<int>(), 0, 4);
      }
      if (doc.containsKey("trigger_ai")) {
        triggerCloudAiQuery = doc["trigger_ai"].as<bool>();
      }
      server.send(200, "application/json", "{\"status\":\"success\",\"buzzer_mode\":" + String(buzzerMode) + "}");
      return;
    }
  }
  
  server.send(400, "application/json", "{\"status\":\"error\",\"message\":\"Malformed JSON\"}");
}

void handleOptions() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Private-Network", "true");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "*");
  server.send(204);
}

void networkWorkerTask(void * pvParameters) {
  for (;;) {
    server.handleClient();
    
    if (triggerCloudAiQuery && (WiFi.status() == WL_CONNECTED)) {
      triggerCloudAiQuery = false;
      runInferenceEngineCore0();
    }
    
    vTaskDelay(10 / portTICK_PERIOD_MS);
  }
}

// ============================================================================
// FULL 8-SLIDE ANIMATED OLED CAROUSEL ENGINE
// ============================================================================
void drawCarouselFooter() {
  display.drawLine(0, 53, 127, 53, SSD1306_WHITE);
  
  for (int i = 0; i < TOTAL_SLIDES; i++) {
    int x = 20 + (i * 12);
    if (i == oledCardIndex) {
      display.fillRect(x - 2, 57, 6, 4, SSD1306_WHITE);
    } else {
      display.drawPixel(x, 58, SSD1306_WHITE); 
    }
  }
}

void renderAnimatedSlides() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  animTick++;

  switch (oledCardIndex) {
    case 0: 
      display.setCursor(0, 0);
      display.printf("AURA | TRIAGE LOCK [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("VICTIMS : %d FOUND", survivorCount);
      
      display.setCursor(0, 25);
      display.printf("ZONE    : [%s]", survivorZoneColor.c_str());
      
      display.setCursor(0, 36);
      display.printf("CONF    : %2d%%", rescueConfidence);
      
      if (survivorCount > 0 && (animTick % 4 < 2)) {
        display.fillRect(116, 14, 8, 8, SSD1306_WHITE);
      }
      break;

    case 1: 
      display.setCursor(0, 0);
      display.printf("AURA | SPATIAL 3D  [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("DEPTH : %.2f METERS", targetDepthMeters);
      
      display.setCursor(0, 25);
      display.printf("RANGE : %.2f METERS", targetRangeMeters);
      
      display.setCursor(0, 36);
      display.printf("POS   : %s", spatialPosition.substring(0, 14).c_str());
      break;

    case 2: 
      display.setCursor(0, 0);
      display.printf("AURA | SEISMIC DSP [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("TAPS  : %d COUNTED", tapCountWindow);
      
      display.setCursor(0, 25);
      display.printf("PEAK  : %d mV", (int)piezoPeakEnvelope);
      
      for (int i = 0; i < 20; i++) {
        int barH = map((int)piezoPeakEnvelope + (i % 3), 0, 100, 1, 14);
        barH = constrain(barH, 1, 14);
        display.drawLine(5 + (i * 6), 48, 5 + (i * 6), 48 - barH, SSD1306_WHITE);
      }
      break;

    case 3: 
      display.setCursor(0, 0);
      display.printf("AURA | ACOUSTIC    [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("AUDIO : %s", acousticSpectrum.substring(0, 14).c_str());
      
      display.setCursor(0, 25);
      display.printf("ENERGY: %d LEVEL", (int)micEnergy);
      
      display.drawRect(0, 38, 127, 8, SSD1306_WHITE);
      {
        int barW = map((int)micEnergy, 0, 80, 0, 123);
        barW = constrain(barW, 0, 123);
        display.fillRect(2, 40, barW, 4, SSD1306_WHITE);
      }
      break;

    case 4: 
      display.setCursor(0, 0);
      display.printf("AURA | BIO-SCENT   [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("GAS   : %d PPM", (int)envGasPPM);
      
      display.setCursor(0, 25);
      display.printf("SCENT : %.1f PPM", humanScentPPM);
      
      display.setCursor(0, 36);
      display.printf("SRC: %s", humanScentLabel.substring(0, 17).c_str());
      break;

    case 5: 
      display.setCursor(0, 0);
      display.printf("AURA | RADAR & IMU [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("RADAR : %s", (rawRadar == 1) ? "MOTION DETECTED" : "SCANNING VOID");
      
      display.setCursor(0, 25);
      display.printf("JERK  : %.2f m/s2", deltaJerk);
      
      display.setCursor(0, 36);
      if (!mpuReady) {
        display.printf("CHEST : IMU DISCONNECTED!");
      } else {
        display.printf("CHEST : %s", (rawRadar == 1) ? "MICRO-FLUTTER" : "STATIC");
      }
      break;

