jafferrilwaan-png/A.U.R.A-System/firmware/esp32_aura_node.ino
    case 6: 
      display.setCursor(0, 0);
      display.printf("AURA | ACTUATOR    [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      display.printf("MODE  : [%d]", buzzerMode);
      
      display.setCursor(0, 25);
      switch (buzzerMode) {
        case 0: display.print(F("STATE : MUTE / QUIET")); break;
        case 1: display.print(F("STATE : BEACON 1.8kHz")); break;
        case 2: display.print(F("STATE : CHIRP 2.4kHz")); break;
        case 3: display.print(F("STATE : SIREN EVAC")); break;
        case 4: display.print(F("STATE : HELP ON WAY")); break;
      }
      
      display.setCursor(0, 36);
      display.printf("SIGNAL: %s", (buzzerMode > 0) ? "TRANSMITTING" : "STANDBY");
      break;

    case 7: 
      display.setCursor(0, 0);
      display.printf("AURA | COMMS & AI  [%d/8]", oledCardIndex + 1);
      display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
      
      display.setCursor(0, 14);
      if (WiFi.status() == WL_CONNECTED) {
        display.printf("SSID  : %s", ssid);
      } else {
        display.print(F("AP    : AURA-NODE"));
      }
      
      display.setCursor(0, 25);
      if (WiFi.status() == WL_CONNECTED) {
        display.printf("IP    : %s", WiFi.localIP().toString().c_str());
      } else {
        display.print(F("IP    : 192.168.4.1"));
      }
      
      display.setCursor(0, 36);
      display.printf("AI    : %s", aiStatus.substring(0, 14).c_str());
      break;
  }

  drawCarouselFooter();
  display.display();
}

// ============================================================================
// SYSTEM BOOT & INITIALIZATION (FIXED WDT & I2C CLOCK SYNC)
// ============================================================================
void setup() {
  Serial.begin(115200);
  delay(600);

  // Watchdog initialization fixed for Arduino-ESP32 v3+
  #if ESP_ARDUINO_VERSION_MAJOR < 3
    esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
  #endif
  esp_task_wdt_add(NULL);

  analogSetAttenuation(ADC_11db);
  pinMode(PIN_PIEZO, INPUT);
  pinMode(PIN_GAS_MQ135, INPUT);
  pinMode(PIN_MIC_OUT, INPUT);
  pinMode(PIN_RADAR_OUT, INPUT_PULLDOWN);

  #if ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(PIN_BUZZER, 2000, BUZZER_PWM_RES);
  #else
    ledcSetup(BUZZER_PWM_CHANNEL, 2000, BUZZER_PWM_RES);
    ledcAttachPin(PIN_BUZZER, BUZZER_PWM_CHANNEL);
  #endif

  setBuzzerTone(2000); 
  delay(100); 
  setBuzzerTone(0); 
  delay(80);
  setBuzzerTone(2800); 
  delay(140); 
  setBuzzerTone(0);

  // 1. Initialize I2C Bus, Set Stable 100kHz Clock Speed, and start OLED
  Wire.begin(21, 22);
  Wire.setClock(100000); // Prevents bus corruption between OLED and MPU6050
  Wire.setTimeOut(50);
  
  if (display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
    oledReady = true;
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(4, 28);
    display.print(F("A.U.R.A. v30.0 ONLINE"));
    display.display();
  }

  // 2. Allow I2C bus to settle completely before MPU query
  delay(150);

  // 3. Auto-Detect MPU-6050 on Primary (0x68) and Alternate (0x69) Addresses
  if (mpu.begin(0x68)) {
    mpuReady = true;
    mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
    Serial.println("[AURA-I2C] MPU-6050 IMU Initialized at Primary Address 0x68!");
  } else if (mpu.begin(0x69)) {
    mpuReady = true;
    mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
    Serial.println("[AURA-I2C] MPU-6050 IMU Initialized at Alternate Address 0x69 (AD0 High)!");
  } else {
    // Run hardware diagnostic I2C bus scan to assist user
    Serial.println("[AURA-I2C] Scanning I2C Bus on GPIO 21 (SDA) & GPIO 22 (SCL)...");
    byte count = 0;
    for (byte i = 8; i < 120; i++) {
      Wire.beginTransmission(i);
      if (Wire.endTransmission() == 0) {
        Serial.printf("  -> Detected I2C Device at: 0x%02X\n", i);
        count++;
      }
    }
    if (count == 0) {
      Serial.println("[AURA-I2C] No I2C devices detected! Check VCC (connect to 5V/VIN or 3.3V) & GND.");
    } else {
      Serial.println("[AURA-I2C] OLED is active, but MPU6050 did not acknowledge 0x68 or 0x69.");
      Serial.println("[AURA-I2C] TIP: Connect MPU6050 VCC to VIN (5V) and ensure GND is shared.");
    }
    mpuReady = false;
    Serial.println("[AURA-I2C] Notice: Using software stabilization fallback. System operational.");
  }

  // 4. Connect Wi-Fi with Automatic AP Mode Fallback
  WiFi.mode(WIFI_AP_STA);
  WiFi.begin(ssid, password);
  Serial.printf("[AURA-WIFI] Connecting to SSID '%s'...", ssid);
  int attempts = 0;
  
  while (WiFi.status() != WL_CONNECTED && attempts < 20) {
    delay(250); 
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    wifiReady = true;
    Serial.printf("\n[AURA-ONLINE] Connected to Wi-Fi! Station IP: %s\n", WiFi.localIP().toString().c_str());
  } else {
    // Auto-fallback to Access Point so web app can ALWAYS connect without an external router
    WiFi.softAP("AURA-TACTICAL-NODE", "12345678");
    IPAddress apIP = WiFi.softAPIP();
    wifiReady = true;
    Serial.printf("\n[AURA-AP-ACTIVE] Router not found. Broadcasting Hotspot 'AURA-TACTICAL-NODE'!\n");
    Serial.printf("[AURA-AP-ACTIVE] Connect your phone/laptop to Wi-Fi 'AURA-TACTICAL-NODE' (password: 12345678)\n");
    Serial.printf("[AURA-AP-ACTIVE] Node IP is: %s\n", apIP.toString().c_str());
  }

  // Display IP immediately on OLED so user sees it without opening Serial Monitor
  if (oledReady) {
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(0, 0);
    display.println(F("PROJECT A.U.R.A. v30"));
    display.drawLine(0, 9, 127, 9, SSD1306_WHITE);
    display.setCursor(0, 16);
    if (WiFi.status() == WL_CONNECTED) {
      display.printf("WIFI : CONNECTED\n");
      display.printf("IP   : %s\n", WiFi.localIP().toString().c_str());
    } else {
      display.printf("AP   : AURA-NODE\n");
      display.printf("IP   : 192.168.4.1\n");
    }
    display.printf("IMU  : %s\n", mpuReady ? "ONLINE (0x68)" : "ACTIVE (STAB)");
    display.setCursor(0, 52);
    display.println(F("CONNECT TO IP IN APP"));
    display.display();
    delay(2000);
  }

  server.on("/api/telemetry", HTTP_GET, handleTelemetryEndpoint);
  server.on("/api/telemetry", HTTP_OPTIONS, handleOptions);
  server.on("/api/control", HTTP_POST, handleControlEndpoint);
  server.on("/api/control", HTTP_OPTIONS, handleOptions);
  server.on("/api/audio", HTTP_GET, handleAudioCaptureEndpoint);
  server.on("/api/audio", HTTP_OPTIONS, handleOptions);

  server.begin();

  xTaskCreatePinnedToCore(networkWorkerTask, "NetworkWorker", 8192, NULL, 1, &NetworkTaskHandle, 0);
}

// ============================================================================
// DETERMINISTIC REAL-TIME DSP (CORE 1)
// ============================================================================
void loop() {
  esp_task_wdt_reset();
  executeBuzzerEngine();

