jafferrilwaan-png/A.U.R.A-System/firmware/esp32_aura_node.ino
  if (millis() - lastDspCycle >= 4) {
    lastDspCycle = millis();

    int instantRadar = digitalRead(PIN_RADAR_OUT);
    
    if (instantRadar != lastRadarState) {
      lastRadarTransitionTime = millis();
      lastRadarState = instantRadar;
    }
    
    if (millis() - lastRadarTransitionTime > 3000) {
      rawRadar = 0; 
    } else {
      if (instantRadar == HIGH) {
        rawRadar = 1;
      } else {
        rawRadar = 0;
      }
    }

    // ULTRA-HIGH SENSITIVITY SEISMIC DSP (Maxed Gain & Low Threshold)
    int instantPiezo = analogRead(PIN_PIEZO);
    rawPiezo = instantPiezo;
    
    piezoBaseline = (piezoBaseline * 0.995f) + ((float)instantPiezo * 0.005f);
    float absolutePiezo = abs((float)instantPiezo - piezoBaseline);
    
    ambientSeismicFloor = (ambientSeismicFloor * 0.999f) + (absolutePiezo * 0.001f);
    piezoInstantDelta = absolutePiezo - ambientSeismicFloor;
    
    float scaledImpulse = 0.0f;
    if (piezoInstantDelta > 0) {
      scaledImpulse = piezoInstantDelta * 12.0f; // Maxed sensitivity gain multiplier
    }
    
    if (scaledImpulse > (float)piezoPeakEnvelope) {
      piezoPeakEnvelope = scaledImpulse;
    } else {
      piezoPeakEnvelope = (float)piezoPeakEnvelope * 0.92f;
    }

    if (scaledImpulse > 1.5f) { // Ultra-low trigger threshold for minor ground taps
      unsigned long now = millis();
      if (now - lastTapTimestamp > 40 && now - lastTapTimestamp < 2000) {
        tapCountWindow++;
        lastTapTimestamp = now;
      } else if (now - lastTapTimestamp >= 2000) {
        tapCountWindow = 1;
        lastTapTimestamp = now;
      }
    }
    
    seismicBuffer[bufferIndex] = (int)piezoPeakEnvelope;
    bufferIndex = (bufferIndex + 1) % SEISMIC_SAMPLES;

    int micMin = 4095;
    int micMax = 0;
    
    for (int i = 0; i < 36; i++) {
      int s = analogRead(PIN_MIC_OUT);
      if (s < micMin) micMin = s;
      if (s > micMax) micMax = s;
      delayMicroseconds(10);
    }
    
    int currentRawMic = micMax - micMin;
    
    micNoiseFloor = (micNoiseFloor * 0.998f) + ((float)currentRawMic * 0.002f);
    float trueAudio = (float)currentRawMic - micNoiseFloor;

    if (trueAudio > 5.0f) {
      micEnergy = ((float)micEnergy * 0.20f) + (trueAudio * 0.80f);
    } else {
      micEnergy = (float)micEnergy * 0.72f;
      if (micEnergy < 1.0f) {
        micEnergy = 0.0f;
      }
    }

    if (micEnergy > 60.0f) {
        acousticSpectrum = "LOUD CRY / SHOUT";
    } else if (micEnergy > 28.0f) {
        acousticSpectrum = "HUMAN SPEECH / VOCAL";
    } else if (micEnergy > 8.0f) {
        acousticSpectrum = "FAINT BREATH / WHISPER";
    } else {
        acousticSpectrum = "SILENCE / NOISE FLOOR";
    }

    processSpatialIntelligence();
  }

  if (millis() - lastSlowCycle >= 200) {
    lastSlowCycle = millis();

    int instantGas = analogRead(PIN_GAS_MQ135);
    rawGas = (instantGas > 45) ? instantGas : 0;
    envGasPPM = 380.0f + (rawGas * 2.2f);
    humanScentPPM = (rawGas > 150) ? ((rawGas - 150) * 0.18f) : 0.0f;
    humanScentDetected = (humanScentPPM > 4.5f);

    if (humanScentPPM > 55.0f) {
      humanScentLabel = "GASTRO/SULFIDE";     
    } else if (humanScentPPM > 35.0f) {
      humanScentLabel = "HEAVY EFFLUENT";      
    } else if (humanScentPPM > 15.0f) {
      humanScentLabel = "SHIRT/BODY ODOR";     
    } else if (humanScentPPM > 4.5f) {
      humanScentLabel = "SALIVA/ORAL VOC";     
    } else {
      humanScentLabel = "CLEAR AMBIENT";
    }

    if (mpuReady) {
      sensors_event_t a, g, temp;
      mpu.getEvent(&a, &g, &temp);
      deltaJerk = sqrt(pow(a.acceleration.x - prevAx, 2) + pow(a.acceleration.y - prevAy, 2) + pow(a.acceleration.z - prevAz, 2));
      prevAx = a.acceleration.x; 
      prevAy = a.acceleration.y; 
      prevAz = a.acceleration.z;
    } else {
      deltaJerk = 0.0f; 
    }

    if (millis() - lastTapTimestamp > 3000) {
        tapCountWindow = 0;
    }

    if (millis() - lastAiCallTime >= AI_QUERY_INTERVAL && (survivorCount > 0 || humanScentDetected)) {
      lastAiCallTime = millis();
      triggerCloudAiQuery = true;
    }
  }

  if (millis() - lastSlideSwitch >= SLIDE_INTERVAL_MS) {
    lastSlideSwitch = millis();
    oledCardIndex = (oledCardIndex + 1) % TOTAL_SLIDES;
  }

  if (oledReady && (millis() - lastOledCycle >= 60)) {
    lastOledCycle = millis();
    renderAnimatedSlides();
  }
}
